----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,472
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5          [-1, 192, 56, 56]         110,784
       BatchNorm2d-6          [-1, 192, 56, 56]             384
              ReLU-7          [-1, 192, 56, 56]               0
         MaxPool2d-8          [-1, 192, 28, 28]               0
            Conv2d-9           [-1, 64, 28, 28]          12,352
      BatchNorm2d-10           [-1, 64, 28, 28]             128
             ReLU-11           [-1, 64, 28, 28]               0
           Conv2d-12           [-1, 96, 28, 28]          18,528
      BatchNorm2d-13           [-1, 96, 28, 28]             192
             ReLU-14           [-1, 96, 28, 28]               0
           Conv2d-15          [-1, 128, 28, 28]         110,720
      BatchNorm2d-16          [-1, 128, 28, 28]             256
             ReLU-17          [-1, 128, 28, 28]               0
           Conv2d-18           [-1, 16, 28, 28]           3,088
      BatchNorm2d-19           [-1, 16, 28, 28]              32
             ReLU-20           [-1, 16, 28, 28]               0
           Conv2d-21           [-1, 32, 28, 28]           4,640
      BatchNorm2d-22           [-1, 32, 28, 28]              64
             ReLU-23           [-1, 32, 28, 28]               0
           Conv2d-24           [-1, 32, 28, 28]           9,248
      BatchNorm2d-25           [-1, 32, 28, 28]              64
             ReLU-26           [-1, 32, 28, 28]               0
        MaxPool2d-27          [-1, 192, 28, 28]               0
           Conv2d-28           [-1, 32, 28, 28]           6,176
      BatchNorm2d-29           [-1, 32, 28, 28]              64
             ReLU-30           [-1, 32, 28, 28]               0
        Inception-31          [-1, 256, 28, 28]               0
           Conv2d-32          [-1, 128, 28, 28]          32,896
      BatchNorm2d-33          [-1, 128, 28, 28]             256
             ReLU-34          [-1, 128, 28, 28]               0
           Conv2d-35          [-1, 128, 28, 28]          32,896
      BatchNorm2d-36          [-1, 128, 28, 28]             256
             ReLU-37          [-1, 128, 28, 28]               0
           Conv2d-38          [-1, 192, 28, 28]         221,376
      BatchNorm2d-39          [-1, 192, 28, 28]             384
             ReLU-40          [-1, 192, 28, 28]               0
           Conv2d-41           [-1, 32, 28, 28]           8,224
      BatchNorm2d-42           [-1, 32, 28, 28]              64
             ReLU-43           [-1, 32, 28, 28]               0
           Conv2d-44           [-1, 96, 28, 28]          27,744
      BatchNorm2d-45           [-1, 96, 28, 28]             192
             ReLU-46           [-1, 96, 28, 28]               0
           Conv2d-47           [-1, 96, 28, 28]          83,040
      BatchNorm2d-48           [-1, 96, 28, 28]             192
             ReLU-49           [-1, 96, 28, 28]               0
        MaxPool2d-50          [-1, 256, 28, 28]               0
           Conv2d-51           [-1, 64, 28, 28]          16,448
      BatchNorm2d-52           [-1, 64, 28, 28]             128
             ReLU-53           [-1, 64, 28, 28]               0
        Inception-54          [-1, 480, 28, 28]               0
        MaxPool2d-55          [-1, 480, 14, 14]               0
           Conv2d-56          [-1, 192, 14, 14]          92,352
      BatchNorm2d-57          [-1, 192, 14, 14]             384
             ReLU-58          [-1, 192, 14, 14]               0
           Conv2d-59           [-1, 96, 14, 14]          46,176
      BatchNorm2d-60           [-1, 96, 14, 14]             192
             ReLU-61           [-1, 96, 14, 14]               0
           Conv2d-62          [-1, 208, 14, 14]         179,920
      BatchNorm2d-63          [-1, 208, 14, 14]             416
             ReLU-64          [-1, 208, 14, 14]               0
           Conv2d-65           [-1, 16, 14, 14]           7,696
      BatchNorm2d-66           [-1, 16, 14, 14]              32
             ReLU-67           [-1, 16, 14, 14]               0
           Conv2d-68           [-1, 48, 14, 14]           6,960
      BatchNorm2d-69           [-1, 48, 14, 14]              96
             ReLU-70           [-1, 48, 14, 14]               0
           Conv2d-71           [-1, 48, 14, 14]          20,784
      BatchNorm2d-72           [-1, 48, 14, 14]              96
             ReLU-73           [-1, 48, 14, 14]               0
        MaxPool2d-74          [-1, 480, 14, 14]               0
           Conv2d-75           [-1, 64, 14, 14]          30,784
      BatchNorm2d-76           [-1, 64, 14, 14]             128
             ReLU-77           [-1, 64, 14, 14]               0
        Inception-78          [-1, 512, 14, 14]               0
           Conv2d-79          [-1, 160, 14, 14]          82,080
      BatchNorm2d-80          [-1, 160, 14, 14]             320
             ReLU-81          [-1, 160, 14, 14]               0
           Conv2d-82          [-1, 112, 14, 14]          57,456
      BatchNorm2d-83          [-1, 112, 14, 14]             224
             ReLU-84          [-1, 112, 14, 14]               0
           Conv2d-85          [-1, 224, 14, 14]         226,016
      BatchNorm2d-86          [-1, 224, 14, 14]             448
             ReLU-87          [-1, 224, 14, 14]               0
           Conv2d-88           [-1, 24, 14, 14]          12,312
      BatchNorm2d-89           [-1, 24, 14, 14]              48
             ReLU-90           [-1, 24, 14, 14]               0
           Conv2d-91           [-1, 64, 14, 14]          13,888
      BatchNorm2d-92           [-1, 64, 14, 14]             128
             ReLU-93           [-1, 64, 14, 14]               0
           Conv2d-94           [-1, 64, 14, 14]          36,928
      BatchNorm2d-95           [-1, 64, 14, 14]             128
             ReLU-96           [-1, 64, 14, 14]               0
        MaxPool2d-97          [-1, 512, 14, 14]               0
           Conv2d-98           [-1, 64, 14, 14]          32,832
      BatchNorm2d-99           [-1, 64, 14, 14]             128
            ReLU-100           [-1, 64, 14, 14]               0
       Inception-101          [-1, 512, 14, 14]               0
          Conv2d-102          [-1, 128, 14, 14]          65,664
     BatchNorm2d-103          [-1, 128, 14, 14]             256
            ReLU-104          [-1, 128, 14, 14]               0
          Conv2d-105          [-1, 128, 14, 14]          65,664
     BatchNorm2d-106          [-1, 128, 14, 14]             256
            ReLU-107          [-1, 128, 14, 14]               0
          Conv2d-108          [-1, 256, 14, 14]         295,168
     BatchNorm2d-109          [-1, 256, 14, 14]             512
            ReLU-110          [-1, 256, 14, 14]               0
          Conv2d-111           [-1, 24, 14, 14]          12,312
     BatchNorm2d-112           [-1, 24, 14, 14]              48
            ReLU-113           [-1, 24, 14, 14]               0
          Conv2d-114           [-1, 64, 14, 14]          13,888
     BatchNorm2d-115           [-1, 64, 14, 14]             128
            ReLU-116           [-1, 64, 14, 14]               0
          Conv2d-117           [-1, 64, 14, 14]          36,928
     BatchNorm2d-118           [-1, 64, 14, 14]             128
            ReLU-119           [-1, 64, 14, 14]               0
       MaxPool2d-120          [-1, 512, 14, 14]               0
          Conv2d-121           [-1, 64, 14, 14]          32,832
     BatchNorm2d-122           [-1, 64, 14, 14]             128
            ReLU-123           [-1, 64, 14, 14]               0
       Inception-124          [-1, 512, 14, 14]               0
          Conv2d-125          [-1, 112, 14, 14]          57,456
     BatchNorm2d-126          [-1, 112, 14, 14]             224
            ReLU-127          [-1, 112, 14, 14]               0
          Conv2d-128          [-1, 144, 14, 14]          73,872
     BatchNorm2d-129          [-1, 144, 14, 14]             288
            ReLU-130          [-1, 144, 14, 14]               0
          Conv2d-131          [-1, 288, 14, 14]         373,536
     BatchNorm2d-132          [-1, 288, 14, 14]             576
            ReLU-133          [-1, 288, 14, 14]               0
          Conv2d-134           [-1, 32, 14, 14]          16,416
     BatchNorm2d-135           [-1, 32, 14, 14]              64
            ReLU-136           [-1, 32, 14, 14]               0
          Conv2d-137           [-1, 64, 14, 14]          18,496
     BatchNorm2d-138           [-1, 64, 14, 14]             128
            ReLU-139           [-1, 64, 14, 14]               0
          Conv2d-140           [-1, 64, 14, 14]          36,928
     BatchNorm2d-141           [-1, 64, 14, 14]             128
            ReLU-142           [-1, 64, 14, 14]               0
       MaxPool2d-143          [-1, 512, 14, 14]               0
          Conv2d-144           [-1, 64, 14, 14]          32,832
     BatchNorm2d-145           [-1, 64, 14, 14]             128
            ReLU-146           [-1, 64, 14, 14]               0
       Inception-147          [-1, 528, 14, 14]               0
          Conv2d-148          [-1, 256, 14, 14]         135,424
     BatchNorm2d-149          [-1, 256, 14, 14]             512
            ReLU-150          [-1, 256, 14, 14]               0
          Conv2d-151          [-1, 160, 14, 14]          84,640
     BatchNorm2d-152          [-1, 160, 14, 14]             320
            ReLU-153          [-1, 160, 14, 14]               0
          Conv2d-154          [-1, 320, 14, 14]         461,120
     BatchNorm2d-155          [-1, 320, 14, 14]             640
            ReLU-156          [-1, 320, 14, 14]               0
          Conv2d-157           [-1, 32, 14, 14]          16,928
     BatchNorm2d-158           [-1, 32, 14, 14]              64
            ReLU-159           [-1, 32, 14, 14]               0
          Conv2d-160          [-1, 128, 14, 14]          36,992
     BatchNorm2d-161          [-1, 128, 14, 14]             256
            ReLU-162          [-1, 128, 14, 14]               0
          Conv2d-163          [-1, 128, 14, 14]         147,584
     BatchNorm2d-164          [-1, 128, 14, 14]             256
            ReLU-165          [-1, 128, 14, 14]               0
       MaxPool2d-166          [-1, 528, 14, 14]               0
          Conv2d-167          [-1, 128, 14, 14]          67,712
     BatchNorm2d-168          [-1, 128, 14, 14]             256
            ReLU-169          [-1, 128, 14, 14]               0
       Inception-170          [-1, 832, 14, 14]               0
       MaxPool2d-171            [-1, 832, 7, 7]               0
          Conv2d-172            [-1, 256, 7, 7]         213,248
     BatchNorm2d-173            [-1, 256, 7, 7]             512
            ReLU-174            [-1, 256, 7, 7]               0
          Conv2d-175            [-1, 160, 7, 7]         133,280
     BatchNorm2d-176            [-1, 160, 7, 7]             320
            ReLU-177            [-1, 160, 7, 7]               0
          Conv2d-178            [-1, 320, 7, 7]         461,120
     BatchNorm2d-179            [-1, 320, 7, 7]             640
            ReLU-180            [-1, 320, 7, 7]               0
          Conv2d-181             [-1, 32, 7, 7]          26,656
     BatchNorm2d-182             [-1, 32, 7, 7]              64
            ReLU-183             [-1, 32, 7, 7]               0
          Conv2d-184            [-1, 128, 7, 7]          36,992
     BatchNorm2d-185            [-1, 128, 7, 7]             256
            ReLU-186            [-1, 128, 7, 7]               0
          Conv2d-187            [-1, 128, 7, 7]         147,584
     BatchNorm2d-188            [-1, 128, 7, 7]             256
            ReLU-189            [-1, 128, 7, 7]               0
       MaxPool2d-190            [-1, 832, 7, 7]               0
          Conv2d-191            [-1, 128, 7, 7]         106,624
     BatchNorm2d-192            [-1, 128, 7, 7]             256
            ReLU-193            [-1, 128, 7, 7]               0
       Inception-194            [-1, 832, 7, 7]               0
          Conv2d-195            [-1, 384, 7, 7]         319,872
     BatchNorm2d-196            [-1, 384, 7, 7]             768
            ReLU-197            [-1, 384, 7, 7]               0
          Conv2d-198            [-1, 192, 7, 7]         159,936
     BatchNorm2d-199            [-1, 192, 7, 7]             384
            ReLU-200            [-1, 192, 7, 7]               0
          Conv2d-201            [-1, 384, 7, 7]         663,936
     BatchNorm2d-202            [-1, 384, 7, 7]             768
            ReLU-203            [-1, 384, 7, 7]               0
          Conv2d-204             [-1, 48, 7, 7]          39,984
     BatchNorm2d-205             [-1, 48, 7, 7]              96
            ReLU-206             [-1, 48, 7, 7]               0
          Conv2d-207            [-1, 128, 7, 7]          55,424
     BatchNorm2d-208            [-1, 128, 7, 7]             256
            ReLU-209            [-1, 128, 7, 7]               0
          Conv2d-210            [-1, 128, 7, 7]         147,584
     BatchNorm2d-211            [-1, 128, 7, 7]             256
            ReLU-212            [-1, 128, 7, 7]               0
       MaxPool2d-213            [-1, 832, 7, 7]               0
          Conv2d-214            [-1, 128, 7, 7]         106,624
     BatchNorm2d-215            [-1, 128, 7, 7]             256
            ReLU-216            [-1, 128, 7, 7]               0
       Inception-217           [-1, 1024, 7, 7]               0
       AvgPool2d-218           [-1, 1024, 1, 1]               0
          Linear-219                   [-1, 10]          10,250
       GoogleNet-220                   [-1, 10]               0
================================================================
Total params: 6,281,258
Trainable params: 6,281,258
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 93.73
Params size (MB): 23.96
Estimated Total Size (MB): 118.27
----------------------------------------------------------------
